package com.example.plantsinbookofsongs.data

object PoemData {
    val PoemData = mapOf(
        //周南
        "关雎" to "周南",
        "葛覃" to "周南",
        "卷耳" to "周南",
        "樛木" to "周南",
        "螽斯" to "周南",
        "桃夭" to "周南",
        "兔罝" to "周南",
        "芣苢" to "周南",
        "汉广" to "周南",
        "汝坟" to "周南",
        "麟之趾" to "周南",
        //召南
        "鹊巢" to "召南",
        "采蘩" to "召南",
        "草虫" to "召南",
        "采苹" to "召南",
        "甘棠" to "召南",
        "行露" to "召南",
        "羔羊" to "召南",
        "殷其雷" to "召南",
        "摽有梅" to "召南",
        "小星" to "召南",
        "江有汜" to "召南",
        "野有死麕" to "召南",
        "何彼襛矣" to "召南",
        "驺虞" to "召南",
        //邶风
        "柏舟" to "邶风",
        "绿衣" to "邶风",
        "燕燕" to "邶风",
        "日月" to "邶风",
        "终风" to "邶风",
        "击鼓" to "邶风",
        "凯风" to "邶风",
        "雄雉" to "邶风",
        "匏有苦叶" to "邶风",
        "谷风" to "邶风",
        "式微" to "邶风",
        "旄丘" to "邶风",
        "简兮" to "邶风",
        "泉水" to "邶风",
        "北门" to "邶风",
        "北风" to "邶风",
        "静女" to "邶风",
        "新台" to "邶风",
        "二子乘舟" to "邶风",
        //鄘风
        "柏舟" to "鄘风",
        "墙有茨" to "鄘风",
        "君子偕老" to "鄘风",
        "桑中" to "鄘风",
        "鹑之奔奔" to "鄘风",
        "定之方中" to "鄘风",
        "蝃蝀" to "鄘风",
        "相鼠" to "鄘风",
        "干旄" to "鄘风",
        "载驰" to "鄘风",
        // ... 添加其他诗和它们的分类
        "鹿鸣" to "小雅·鹿鸣之什",
        "四牡" to "小雅·鹿鸣之什",
        "皇皇者华" to "小雅·鹿鸣之什",
        // ... 添加更多小雅、大雅、颂中的诗
    )
    fun getPoem():Map<String,String>{
        return PoemData
    }
}